[
    {
    "riddle": "It is greater than God and more evil than the devil. The poor have it, the rich need it and if you eat it you’ll die. What is it?",
    "answer": "nothing"
    },
    {
    "riddle": "It walks on four legs in the morning, two legs at noon and three legs in the evening. What is it?",
    "answer": "man"
    },
    {
    "riddle": "I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?",
    "answer": "the letter e",
    "info": "End, timE, spacE, Every placE"
    },
    {
    "riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
    "answer": "a river"
    },
    {
    "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breath on this terrestrial ball. What am I?",
    "answer": "the future"
    },
    {
    "riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?",
    "answer": "the stars"
    },
    {
    "riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?",
    "answer": "the letter n"
    },
    {
    "riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he’s using it. What is it?",
    "answer": "a coffin"
    },
    {
    "riddle": "The more you have of it, the less you see. What is it?",
    "answer": "Darkness"
    },
    {
    "riddle": "What smells like purple paint, tastes like green paint, and can appear as a white dove?",
    "answer": "white paint"
    },
    {
    "riddle": "You start in the top left corner of a 6x6 grid, your goal is to get to the bottom right corner. You can only move to the right or down. You can't move diagonally and you can't move backwards.\nHow many different ways are there to get from the start to the finish?",
    "answer": "252"
    },
    {
    "riddle": "There are 9 coins, all except one are the same weight, the odd one is heavier than the rest. You must determine which is the odd one out using an old fashioned balance. How many times do you need to use the balance at a minimum, to determine which coin is the heavier one?",
    "answer": "2"
    },
    {
    "riddle": "100 people stand in a circle in order 1 to 100. No. 1 has a sword. He kills the next person (i.e. No. 2) and gives the sword to the next living person (i.e. No. 3). All people do the same until only 1 survives. Which number survives to the end?",
    "answer": "73"
    },
    {
    "riddle": "A snail is at the bottom of a 30 foot well. Every hour the snail is able to climb up 3 feet, then immediately slide back down 2 feet. How many hours does it take for the snail to get out of the well?",
    "answer": "28"
    },
    {
    "riddle": "Watermelon is 99% water. I have 100 pounds of watermelon. After a week, drying in the sun, the shrivelled watermelon had only dried down to being 98% water. What is the total weight of the watermelon now?",
    "answer": "50"
    },
    {
    "riddle": "An executioner lines up 100 prisoners single file and puts a red or a blue hat on each prisoner's head. Every prisoner can see the hats of the people in front of him in the line - but not his own hat, nor those of anyone behind him. The executioner starts at the end (back) and asks the last prisoner the colour of his hat. He must answer 'red' or 'blue'. If he answers correctly, he is allowed to live. If he gives the wrong answer, he is killed instantly and silently. (While everyone hears the answer, no one knows whether an answer was right.) On the night before the line-up, the prisoners confer on strategy to help them. How many prisoners can you guarantee to survive at most?",
    "answer": "99"
    },
    {
    "riddle": "You are given a lighter and two ropes that will burn for exactly 1 hour. The ropes do not burn consistently from one end to the other (some parts burn faster than others). How can you time 45 minutes using only what you're given?\nThe ropes:\n 1 ======= 2\n 3 ======= 4\nAnswer using keywords: 'light <number>' and 'wait <rope 1 or 2>'\ne.g.: 'light 1 wait 1 light 3'. This means light end 1 from the start, wait until the first rope burns up, then light end 3",
    "answer": "light 1 light 2 light 3 wait 1 light 4"
    },
    {
    "riddle": "Imagine there's an island somewhere in the world that's controlled by a mad dictator who keeps one hundred people imprisoned. The island is swarming with guards, and the waters are filled with sharks. There's no way these people can just escape their fate, except they are all free to leave every night!\nThe rule is that any prisoner can approach the guards at night, and ask the leave, but only if they have green eyes. Since there are no mirrors on the island, and they are unable to communicate amongst themselves, the prisoners do no know their own eye colour. The trick is that all of the one hundred prisoners have greens.\nAs human rights organisations world wide try to get the prisoners freed, you alone are selected to try and find a way to save all those people. The dictator allows you to to speak to the prisoners just once, but there are rules:\n1) You can only make one statement.\n2) You cannot tell them any new information.\n\nYou decide to tell the prisoners \"At least one of you has green eyes.\"\nAfter how many days is the prison empty?",
    "answer": "100"
    },
    {
    "riddle": "What is the smallest positive integer that leaves a remainder of 1 when divided by 2, remainder of 2 when divided by 3, a remainder of 3 when divided by 4, and so on up to a remainder of 9 when divided by 10?",
    "answer": "2519"
    },
    {
    "riddle": "Sorry, no riddle today. You can add more riddles in the hubot scripts repository in the file riddles.json",
    "answer": "====="
    }
]
